#include <iostream>
#include <clocale>
#include <cmath>
#include <cstring>
#include <bitset>
#include <fstream>
#include <ctime>
#include <ios>
#include <sstream>

#include "ModulesLisevych.h"

using namespace std;

double s_calculation(float x, float z)
{
    const double PI = 3.14159;
    return (0.5*pow((abs(2*z - pow(x, 2))/sin(x)), 3))/(sqrt(1+abs(cos(x)))+2*PI);
}


// Завдання 9.1, 9.2, 9.3, 9.4
string windSpeed(int wSpeed)
{
    if(wSpeed < 0.3){
        return "Бал Бофорта: 0";
    }
    if(wSpeed >= 0.3 && wSpeed <= 1.5){
        return "Бал Бофорта: 1";
    }
    if(wSpeed >= 1.6 && wSpeed <= 3.4){
        return "Бал Бофорта: 2";
    }
    if(wSpeed >= 3.5 && wSpeed <= 5.4 ){
        return "Бал Бофорта: 3";
    }
    if(wSpeed >= 5.5 && wSpeed <= 7.9){
        return "Бал Бофорта: 4";
    }
    if(wSpeed >= 8 && wSpeed <= 10.7){
        return "Бал Бофорта: 5";
    }
    if(wSpeed >= 10.8 && wSpeed <= 13.8){
        return "Бал Бофорта: 6";
    }
    if(wSpeed >= 13.9 && wSpeed <= 17.1){
        return "Бал Бофорта: 7";
    }
    if(wSpeed >= 17.2 && wSpeed <= 20.7){
        return "Бал Бофорта: 8";
    }
    if(wSpeed >= 20.8 && wSpeed <= 24.4){
        return "Бал Бофорта: 9";
    }
    if(wSpeed >= 24.5 && wSpeed <= 28.4){
        return "Бал Бофорта: 10";
    }
    if(wSpeed >= 28.5 && wSpeed <= 32.6){
        return "Бал Бофорта: 11";
    }
    if(wSpeed >= 32.7){
        return "Бал Бофорта: 12";
    }
}

int temp_cel(int day1, int day2, int day3, int day4, int day5, int day6, int day7)
{
    int cel = (day1 + day2 + day3 + day4 + day5 + day6 + day7) / 7;
    return cel;
}

int temp_far(float cel)
{
    int far;
    far = 32 + 1.8 * cel;
    return far;
}

int bits_number(int number)
{
    bitset<32> b_number{number};
    if (b_number[7]) {
        return 32 - b_number.count();
    }
    return b_number.count();
}


// Завдання 10.1, 10.2, 10.3
void checkFile(string outputFileName, string inputFileName)
{
    ofstream inputFile(inputFileName);
    ofstream outputFile(outputFileName);

    if (!inputFile || !outputFile){
        cout << "Помилка, неможливо відкрити файл для редагування\a" << endl;
        inputFile.close();
        outputFile.close();
        exit(1);
    }
    inputFile.close();
    outputFile.close();
}

bool inputTxtFile(string inputFileName, string inputText)
{
    ofstream inputFile(inputFileName, ios::out);
    inputFile << inputText << endl;
    inputFile.close();
    return true;
}

// Task 10.1
bool infoBlock(string outputFileName)
{
    ofstream outputFile(outputFileName, ios::out);
    outputFile << " ------------------------------- \n"
               << "| Лісевич Дмитро Сергійович     |\n"
               << "| ЦНТУ                          |\n"
               << "| Україна, Кропивницький        |\n"
               << "| 2022                          |\n"
               << " ------------------------------- \n\n" << endl;
               outputFile.close();
}

string language(string outputFileName, string text)
{
    bool flag = true;
    string beta = text;
    ofstream outputFile(outputFileName, ios::in);
    outputFile.close();

    outputFile.open(outputFileName, ios::in);
    if(outputFile.is_open())
    {
        for(int i = 0; i < text.length(); i++)
        {
        if((text[i] >= 'A' && text[i] <= 'Z') || (text[i] >= 'a' && text[i] <= 'z'))
            flag = true;
        if((text[i] >= 'А' && text[i] <= 'Я') || (text[i] >= 'а' && text[i] <= 'я'))
            flag = false;
        }
    }
    outputFile.close();

    outputFile.open(outputFileName, ios::app);
    if(outputFile.is_open())
    {
        outputFile << text << endl;
        outputFile << "Мова: " << ((flag == true) ? "Англійська\n" : "Україньска\n");
    }

    outputFile.open(outputFileName, ios::in);
    if(outputFile.is_open())
    {
       if(flag == true)
        {
            for(int i =0; i < text.length(); i++)
            {
                if(text[i] >= 'a' && text[i] <= 'z')
                    beta[i] = text[i] - 32;
                else
                    beta[i] = text[i];
            }
        }
        else
        {

            for(int i =0; i < text.length(); i++)
            {
                if((text[i] == 'л') && (text[i+1] == 'і') && (text[i+2] == 'н') && (text[i+3] == 'о') && (text[i+4] == 'щ') && (text[i+5] == 'і'))
                {
                    beta[i] = ' ';
                    beta[i+1] = ' ';
                    beta[i+2] = ' ';
                    beta[i+3] = ' ';
                    beta[i+4] = ' ';
                    beta[i+5] = ' ';
                }
                if((text[i] == 'с') && (text[i+1] == 'е') && (text[i+2] == 'с') && (text[i+3] == 'і') && (text[i+4] == 'я'))
                {
                    beta[i] = ' ';
                    beta[i+1] = ' ';
                    beta[i+2] = ' ';
                    beta[i+3] = ' ';
                    beta[i+4] = ' ';
                }
                if((text[i] == 'а') && (text[i+1] == 'к') && (text[i+2] == 'а') && (text[i+3] == 'д') && (text[i+4] == 'е') && (text[i+5] == 'м')
                && (text[i+6] == 'з') && (text[i+7] == 'а') && (text[i+8] == 'б') && (text[i+9] == 'о') && (text[i+10] == 'р') && (text[i+11] == 'г')
                && (text[i+12] == 'о') && (text[i+13] == 'в') && (text[i+14] == 'а') && (text[i+15] == 'н') && (text[i+16] == 'і') && (text[i+17] == 'с')
                && (text[i+18] == 'т') && (text[i+19] == 'ь'))
                {
                    beta[i] = ' ';
                    beta[i+1] = ' ';beta[i+2] = ' ';beta[i+3] = ' ';beta[i+4] = ' ';beta[i+5] = ' ';beta[i+5] = ' ';beta[i+5] = ' ';
                    beta[i+6] = ' ';beta[i+7] = ' ';beta[i+8] = ' ';beta[i+9] = ' ';beta[i+10] = ' ';beta[i+11] = ' ';beta[i+12] = ' ';
                    beta[i+13] = ' ';beta[i+14] = ' ';beta[i+15] = ' ';beta[i+16] = ' ';beta[i+17] = ' ';beta[i+18] = ' ';beta[i+19] = ' ';

                }
            }
        }
    }
    outputFile.close();

    outputFile.open(outputFileName, ios::app);
    if(outputFile.is_open())
    {
        outputFile << beta << endl;
    }
    outputFile.close();
}

// Task 10.2
string article62(string inputFileName)
{
    string article;
    fstream inputFile(inputFileName, ios::out);
    if(inputFile.is_open())
    {
        article = "Стаття 62. Права осіб, які навчаються у у закладах вищої освіти."
                  "1. Особи, які навчаються у вищих навчальних закладах, мають право на:\n"
                  "1) вибір форми навчання під час вступу до вищого навчального закладу;\n"
                  "2) безпечні і нешкідливі умови навчання, праці та побуту;\n"
                  "3) трудову діяльність у позанавчальний час;\n"
                  "4) додаткову оплачувану відпустку у зв’язку з навчанням за основним місцем роботи, скорочений робочий час та інші пільги, передбачені законодавством для осіб, які поєднують роботу з навчанням;\n"
                  "5) безоплатне користування бібліотеками, інформаційними фондами, навчальною, науковою та спортивною базами вищого навчального закладу;\n"
                  "6) безоплатне забезпечення інформацією для навчання у доступних форматах з використанням технологій, що враховують обмеження життєдіяльності, зумовлені станом здоров’я (для осіб з особливими освітніми потребами);\n"
                  "7) користування виробничою, культурно-освітньою, побутовою, оздоровчою базами вищого навчального закладу у порядку, передбаченому статутом вищого навчального закладу;\n"
                  "8) забезпечення гуртожитком на строк навчання у порядку, встановленому законодавством;\n"
                  "9) участь у науково-дослідних, дослідно-конструкторських роботах, конференціях, симпозіумах, виставках, конкурсах, представлення своїх робіт для публікації;\n"
                  "10) участь у заходах з освітньої, наукової, науково-дослідної, спортивної, мистецької, громадської діяльності, що проводяться в Україні та за кордоном, у встановленому законодавством порядку;\n"
                  "11) участь в обговоренні та вирішенні питань удосконалення навчального процесу, науково-дослідної роботи, призначення стипендій, організації дозвілля, побуту, оздоровлення;\n"
                  "12) внесення пропозицій щодо умов і розміру плати за навчання;\n"
                  "13) участь у громадських об’єднаннях;\n"
                  "14) участь у діяльності органів громадського самоврядування вищого навчального закладу, інститутів, факультетів, відділень, вченої ради вищого навчального закладу, органів студентського самоврядування;\n"
                  "15) вибір навчальних дисциплін у межах, передбачених відповідною освітньою програмою та робочим навчальним планом, в обсязі, що становить не менш як 25 відсотків загальної кількості кредитів ЄКТС, передбачених для даного рівня вищої освіти. При цьому здобувачі певного рівня вищої освіти мають право вибирати навчальні дисципліни, що пропонуються для інших рівнів вищої освіти, за погодженням з керівником відповідного факультету чи підрозділу;\n"
                  "16) навчання одночасно за декількома освітніми програмами, а також у декількох вищих навчальних закладах, за умови отримання тільки однієї вищої освіти за кожним ступенем за кошти державного (місцевого) бюджету;\n"
                  "17) академічну мобільність, у тому числі міжнародну;\n"
                  "18) отримання соціальної допомоги у випадках, встановлених законодавством;\n"
                  "19) зарахування до страхового стажу відповідно до Закону України \"Про загальнообов’язкове державне пенсійне страхування\" періодів навчання на денній формі навчання у вищих навчальних закладах, аспірантурі, докторантурі, клінічній ординатурі, інтернатурі, резидентурі, за умови добровільної сплати страхових внесків;\n"
                  "20) академічну відпустку або перерву в навчанні із збереженням окремих прав здобувача вищої освіти, а також на поновлення навчання у порядку, встановленому центральним органом виконавчої влади у сфері освіти і науки;\n"
                  "21) участь у формуванні індивідуального навчального плану;\n"
                  "22) моральне та/або матеріальне заохочення за успіхи у навчанні, науково-дослідній і громадській роботі, за мистецькі та спортивні досягнення тощо;\n"
                  "23) захист від будь-яких форм експлуатації, фізичного та психічного насильства;\n"
                  "24) безоплатне проходження практики на підприємствах, в установах, закладах та організаціях, а також на оплату праці під час виконання виробничих функцій згідно із законодавством;\n"
                  "25) канікулярну відпустку тривалістю не менш як вісім календарних тижнів на навчальний рік;\n"
                  "26) отримання цільових пільгових державних кредитів для здобуття вищої освіти у порядку, визначеному Кабінетом Міністрів України;\n"
                  "27) оскарження дій органів управління вищого навчального закладу та їх посадових осіб, педагогічних і науково-педагогічних працівників;\n"
                  "28) спеціальний навчально-реабілітаційний супровід та вільний доступ до інфраструктури вищого навчального закладу відповідно до медико-соціальних показань за наявності обмежень життєдіяльності, зумовлених станом здоров’я.\n"
                  "2. Особи, які навчаються у вищих навчальних закладах за денною формою навчання за рахунок коштів державного або місцевих бюджетів, мають право на отримання стипендій у встановленому законодавством порядку.\n"
                  "3. Особи, які навчаються у вищих навчальних закладах за денною формою навчання, можуть отримувати інші стипендії, призначені фізичними (юридичними) особами.\n"
                  "4. Розмір стипендіального фонду вищого навчального закладу повинен забезпечувати виплату академічних стипендій не менш як двом третинам і не більш як 75 відсоткам студентів (курсантів невійськових вищих навчальних закладів) денної форми навчання, які навчаються за кошти державного бюджету, без урахування осіб, які отримують соціальні стипендії.\n"
                  "5. Розмір академічної та соціальної стипендій, порядок їх призначення і виплати встановлюються Кабінетом Міністрів України.\n"
                  "6. Розмір мінімальної академічної та соціальної стипендій для здобувачів освітніх ступенів вищої освіти не може бути меншим, ніж розмір прожиткового мінімуму з розрахунку на одну особу на місяць. Розмір мінімальної академічної та соціальної стипендій для здобувачів ступеня молодшого бакалавра не може бути меншим, ніж дві третини розміру прожиткового мінімуму з розрахунку на одну особу на місяць.\n"
                  "7. Академічні стипендії виплачуються не менш як двом третинам студентів (курсантів) кожного курсу (крім першого семестру першого року навчання) за кожною спеціальністю, без урахування осіб, які отримують соціальні стипендії. Академічну стипендію отримують студенти (курсанти), які згідно з рейтингом, складеним у вищому навчальному закладі за результатами семестрового контролю, здобули найкращі результати навчання. До проведення першого семестрового контролю академічна стипендія у мінімальному розмірі призначається всім студентам (курсантам), зарахованим до вищого навчального закладу на перший курс навчання.\n"
                  "8. Особам, які досягли значних успіхів у навчанні та/або науковій діяльності, за рішенням вченої ради вищого навчального закладу можуть призначатися персональні стипендії.\n"
                  "9. Здобувачі вищої освіти, які навчаються у вищих навчальних закладах за денною формою навчання, мають право на пільговий проїзд у транспорті у порядку, встановленому Кабінетом Міністрів України.\n"
                  "10. Студенти, курсанти вищих навчальних закладів мають право на отримання студентського квитка, зразок якого затверджується центральним органом виконавчої влади у сфері освіти і науки.\n";
        inputFile << article << endl;
        time_t t;
        t = time(NULL);
        inputFile << ctime(&t);
    }
}

bool timeInFile(string inputFileName)
{
    ofstream inputFile(inputFileName, ios::app);
    time_t indefTime;
    time(&indefTime);
    inputFile << "Дата та чат дозапису інформації: " << ctime(&indefTime) << endl;
    inputFile.close();
    return true;
}

// Task 10.3
double sCalculationInFile(string outputFileName, float x, float z)
{
    ofstream outputFile("outputFile.txt", ios::app);
    outputFile << "Результат виконання функції s_calculation: " << s_calculation(x, z) << endl;
    outputFile.close();
    return s_calculation(x, z);
}

bool numberBinFile(string outputFileName, int b)
{
    ofstream outputFile(outputFileName, ios::app);
    bitset<32> b_number(b);
    outputFile << "Число " << b << " у двійковому коді: " << b_number << endl;
    outputFile.close();
    return true;
}

int howManySymbols(string outputFileName, string inputTextInFile)
{
    ofstream outputFile(outputFileName, ios::app);

    int numberSymbol = 0;

    for (int i = 0; i < inputTextInFile.length(); i++){
        if (inputTextInFile[i] != ' '){
            numberSymbol++;
        }
    }
    outputFile << "Кількість символів з вхідного файлу: " << numberSymbol << endl;
    return numberSymbol;
}

